Revit 2026 API

# BalusterPatternExcessLengthFillSpacing Property

---

The value defines the spacing between each baluster instance inserted in the excess length.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ExcessLengthFillSpacing { get; set; }
```
```vb
Public Property ExcessLengthFillSpacing As Double
	Get
	Set
```
```cpp
public:
property double ExcessLengthFillSpacing {
	double get ();
	void set (double value);
}
```
```fsharp
member ExcessLengthFillSpacing : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for excessLengthFillSpacing must be between 0 and 30000 feet. |

The spacing is used only if a baluster family is set to excess length fill.

#### Reference

BalusterPattern Class

Autodesk.Revit.DB.Architecture Namespace